frontend/controllers/VacancyController.php

    public function actionIndex()
    {
        $loc = new Location;
        $locationItems = $loc->find()
            ->select(['city as value', 'location as label', 'id as id'])
            ->asArray()
            ->all();
        $city = new Cities;
        $vacancy = new Vacancy();
        $scope = new Scope;
        $scopeItems = $scope->find()
            ->select(['scope as value', 'id as id'])
            ->asArray()
            ->all();

        if ($vacancy->load(Yii::$app->request->post()) && $vacancy->save())
        {
            $vacancy = new Vacancy();
        }

        $searchModel = new VacancySearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
---
SELECT `city` AS `value`, `location` AS `label`, `id` AS `id` FROM `location`
SELECT `city` AS `value`, `city` AS `label`, `id` AS `id` FROM `cities`
SELECT `scope` AS `value`, `scope` AS `label`, `id` AS `id` FROM `scope`
INSERT INTO `vacancy` (`title`, `text`, `date`, `minprice`, `maxprice`, `employer_id`, `scope_id`, `skill_id`, `jobtime_id`, `city_id`, `mtop`) VALUES ('Тестировщик senior', 'Тестировщик senior', '2016-06-23', 120000, 130000, 2, 6, 2, 2, 9702, 0)

    protected function findModel($id)
    {
        if (($model = Vacancy::findOne($id)) !== null) {
---
SELECT * FROM `vacancy` WHERE `id`='16'